---
kind: property
id: P:Autodesk.Revit.DB.ExportFontKey.OriginalFontName
source: html/0f593cef-4eb5-cb3f-138d-013bd75ba5e0.htm
---
# Autodesk.Revit.DB.ExportFontKey.OriginalFontName Property

The original font name.

## Syntax (C#)
```csharp
public string OriginalFontName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null